<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class AdSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table( 'ads' )->delete();
        $ads = array(
            array( 'sku' => '7209027818', 'title' => "ينز", 'description' => "نعم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً تم توليد هذا النص العرب من موقعه لفه مثال نص عربى كبير هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة . مثال نص عربى كبير", 'location' => "حارة الحافة، جوار مسجد عمر", 'price' => 40000, 'user_id' => 1, 'published_at' => now(), 'created_at' => now() ),
            array( 'sku' => '7209027819', 'title' => "كورلا", 'description' => "نعم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً تم توليد هذا النص العرب من موقعه لفه مثال نص عربى كبير هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة . مثال نص عربى كبير", 'location' => "حارة الحافة، جوار مسجد عمر", 'price' => 16000, 'user_id' => 1, 'published_at' => now(), 'created_at' => now() ),
            array( 'sku' => '7209027810', 'title' => "اكورد", 'description' => "نعم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً تم توليد هذا النص العرب من موقعه لفه مثال نص عربى كبير هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة . مثال نص عربى كبير", 'location' => "حارة الحافة، جوار مسجد عمر", 'price' => 10000, 'user_id' => 1, 'published_at' => now(), 'created_at' => now() ),
            array( 'sku' => '7209027811', 'title' => "ألنترا", 'description' => "نعم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً تم توليد هذا النص العرب من موقعه لفه مثال نص عربى كبير هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة . مثال نص عربى كبير", 'location' => "حارة الحافة، جوار مسجد عمر", 'price' => 7000, 'user_id' => 1, 'published_at' => now(), 'created_at' => now() ),
            array( 'sku' => '7209027812', 'title' => "الـفئة الـخامسة", 'description' => "نعم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً تم توليد هذا النص العرب من موقعه لفه مثال نص عربى كبير هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة . مثال نص عربى كبير", 'location' => "حارة الحافة، جوار مسجد عمر", 'price' => 30000, 'user_id' => 1, 'published_at' => now(), 'created_at' => now() ),
            array( 'sku' => '7209027813', 'title' => "سفك", 'description' => "نعم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً تم توليد هذا النص العرب من موقعه لفه مثال نص عربى كبير هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة . مثال نص عربى كبير", 'location' => "حارة الحافة، جوار مسجد عمر", 'price' => 20000, 'user_id' => 1, 'published_at' => now(), 'created_at' => now() ),
            array( 'sku' => '7209027814', 'title' => "لاندكروزر", 'description' => "نعم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً تم توليد هذا النص العرب من موقعه لفه مثال نص عربى كبير هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة . مثال نص عربى كبير", 'location' => "حارة الحافة، جوار مسجد عمر", 'price' => 35000, 'user_id' => 1, 'published_at' => now(), 'created_at' => now() ),
            array( 'sku' => '7209027815', 'title' => "xd3", 'description' => "نعم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً تم توليد هذا النص العرب من موقعه لفه مثال نص عربى كبير هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة . مثال نص عربى كبير", 'location' => "حارة الحافة، جوار مسجد عمر", 'price' => 35000, 'user_id' => 1, 'published_at' => now(), 'created_at' => now() ),
            array( 'sku' => '7209027816', 'title' => "مازدا3", 'description' => "نعم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً تم توليد هذا النص العرب من موقعه لفه مثال نص عربى كبير هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة . مثال نص عربى كبير", 'location' => "حارة الحافة، جوار مسجد عمر", 'price' => 35000, 'user_id' => 1, 'published_at' => now(), 'created_at' => now() ),
            array( 'sku' => '7209027817', 'title' => "بـتروال", 'description' => "نعم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً تم توليد هذا النص العرب من موقعه لفه مثال نص عربى كبير هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة . مثال نص عربى كبير", 'location' => "حارة الحافة، جوار مسجد عمر", 'price' => 35000, 'user_id' => 1, 'published_at' => now(), 'created_at' => now() ),
            array( 'sku' => '7209027918', 'title' => "ربع", 'description' => "نعم دون مشكلة فلن يبدو وكأنه نص منسوخ، غير منظم، غير منسق، أو حتى غير مفهوم. لأنه مازال نصاً بديلاً ومؤقتاً تم توليد هذا النص العرب من موقعه لفه مثال نص عربى كبير هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة . مثال نص عربى كبير", 'location' => "حارة الحافة، جوار مسجد عمر", 'price' => 35000, 'user_id' => 1, 'published_at' => now(), 'created_at' => now() ),
        );
        DB::table( 'ads' )->insert( $ads );
    }
}
